import React from 'react';
import './Question.css'

const Question = () => {
      return (
            <div className='question my-4 '> 
                  <div className="container bg-light p-5">
                        <div className="row">
                              <div className="col-lg-6">
                                    <h3>How react warks?
                                                            </h3>
                                    <p>রিয়েক্ট হলো একটি জাভাস্ক্রিপ্ট লাইব্রেরি। এটি মোবাইল এবং ওয়েব পেইজ এপ্লিকেশন ডেভেলপমেন্ট এর জন্য  ব্যবহার করা হয়। রিয়েক্ট সাধারণত সিংগেল ইউজার ইন্টার ফেইস তৈরিতে ব্যবহার করা হয়। এটি একটি ওপেন সোন্স লাইব্রেরি। </p>
                                    <p>রিয়েক্ট ডিক্লারেটিভ। অর্থাৎ এটি খুব সহজে যে কোনো কিছু ডিকলার করা যায়। তাছাড়া রিয়েক্ট এর রয়েছে কম্পোনেন্ট ব্যাস। এটি মাধ্যমে যেকোনো কম্পোনেন্ট বানিয়ে কাজ করা যায়।</p>
                                    <p>সাধারণ এটি কাজ করে থাকে ভারচুয়াল ডম এর মধ্যমে। যখন ইউজার ইন্টারফেস এ কোনো কিছু পরিবর্তন হয় তখন রিয়েক্ট এর কাছে থাকা ভারচুয়াল ডমের সাথে কম্পিয়ার করে। যখন কোনো কিছু পরিবর্তন হয় তখন এই ডমের ধারা সেটিকে খুজে বের করে সেই জায়গাই পরিবর্তন ঘটায়। আর এই কাজটা হয়ে থাকে রিয়েক্ট রেন্ডার এর মাধ্যমে।</p>



                              </div>
                              <div className="col-lg-6">
                                    <h3>Difference Between Props And State.</h3>
                                   <p>Props: কোনো একটা ফাংশনে ডাটা পাটাতে সাধারণ props এর মাধ্যমে পাঠানো।</p>
                                   <li className="list-item">প্রোপ্স হচ্ছে শুধু মাএ রিড ওনলি।</li>
                                   <li className="list-item">State এর জন্য props ব্যবহার করা হয়।</li>
                                   <li className="list-item">এটিকে পরিবর্তন করা যায় না।</li>

                                   <p>state: ওয়েব সাইটের কোনো কিছু পরিবর্তন করার জন্য সাধারণত state ব্যবহার করা হয়।</p>
                                   <li className="list-item">এটিকে পরিবর্তন করা যায়।</li>
                                   <li className="list-item">এটি কম্পোনেন্ট এ ডাটা পাঠানো হয়।</li>
                              </div>
                        </div>
                  </div>
                  
            </div>
      );
};

export default Question;